{
  "Adho Mukha Svanasana": ["Downward-Facing Dog Pose", "A foundational yoga pose that strengthens the arms and legs while stretching the spine."],
  "Adho Mukha Vrksasana": ["Handstand Pose", "An inversion that builds strength in the shoulders and core while improving balance."],
  "Alanasana": ["High Lunge Pose", "Stretches the hips and thighs, strengthens the legs, and improves balance and focus."],
  "Anjaneyasana": ["Low Lunge Pose", "Opens the hips, stretches the thighs, and improves flexibility in the hip flexors."],
  "Ardha Chandrasana": ["Half Moon Pose", "Develops balance and stability, strengthens the legs, and stretches the sides of the body."],
  "Ardha Matsyendrasana": ["Half Lord of the Fishes Pose", "Twisting pose that benefits the spine, improves digestion, and stretches the shoulders."],
  "Ardha Navasana": ["Half Boat Pose", "Strengthens the core muscles and improves balance."],
  "Ardha Pincha Mayurasana": ["Dolphin Pose", "Prepares the body for more advanced inversions, strengthening the arms and shoulders."],
  "Ashta Chandrasana": ["Eight-Limbed Crescent Moon Pose", "Combines strength and balance, opening the chest and improving flexibility."],
  "Baddha Konasana": ["Bound Angle Pose", "Opens the hips, improves flexibility, and stimulates the reproductive organs."],
  "Bakasana": ["Crow Pose", "Arm balance that strengthens the wrists, arms, and abdominal muscles."],
  "Balasana": ["Child's Pose", "Restorative pose that helps release tension in the back, neck, and shoulders."],
  "Bitilasana": ["Cow Pose", "A gentle spinal warm-up that improves flexibility and coordination."],
  "Camatkarasana": ["Wild Thing Pose", "Expands the chest, strengthens the arms, and opens the hips."],
  "Dhanurasana": ["Bow Pose", "Backbend that strengthens the back muscles and improves posture."],
  "Eka Pada Rajakapotasana": ["One-Legged King Pigeon Pose", "Deep hip opener that stretches the thighs, groins, and psoas."],
  "Garudasana": ["Eagle Pose", "Strengthens the legs and arms while improving balance and concentration."],
  "Halasana": ["Plow Pose", "Stretches the spine, shoulders, and hamstrings, and stimulates the abdominal organs."],
  "Hanumanasana": ["Monkey Pose", "Deep stretch for the hamstrings and hip flexors, improving flexibility."],
  "Malasana": ["Garland Pose", "Strengthens the lower back, ankles, and tones the abdominal muscles."],
  "Marjaryasana": ["Cat Pose", "A gentle stretch for the back and neck, promoting flexibility and spinal mobility."],
  "Navasana": ["Boat Pose", "Strengthens the core muscles and improves balance."],
  "Padmasana": ["Lotus Pose", "Promotes flexibility in the hips and knees, and encourages good posture."],
  "Parsva Virabhadrasana": ["Side Warrior Pose", "Strengthens the legs, opens the hips, and stretches the side body."],
  "Parsvottanasana": ["Pyramid Pose", "Stretches the hamstrings, calves, and hips while improving balance."],
  "Paschimottanasana": ["Seated Forward Bend", "Stretches the spine, hamstrings, and lower back, promoting relaxation."],
  "Phalakasana": ["Plank Pose", "Strengthens the core muscles, arms, and wrists."],
  "Pincha Mayurasana": ["Forearm Stand", "Inversion that strengthens the shoulders, arms, and core."],
  "Salamba Bhujangasana": ["Sphinx Pose", "Mild backbend that helps improve posture and strengthen the spine."],
  "Salamba Sarvangasana": ["Shoulder Stand", "Inversion that promotes blood circulation, calms the mind, and strengthens the shoulders."],
  "Setu Bandha Sarvangasana": ["Bridge Pose", "Strengthens the legs, opens the chest, and stretches the spine."],
  "Sivasana": ["Corpse Pose", "A relaxation pose to release stress, calm the mind, and rejuvenate the body."],
  "Supta Kapotasana": ["Reclining Pigeon Pose", "Stretches the hips and thighs, releasing tension in the lower back."],
  "Trikonasana": ["Triangle Pose", "Stretches and strengthens the legs, opens the hips, and improves posture."],
  "Upavistha Konasana": ["Wide-Angle Seated Forward Bend", "Stretches the inner thighs and groins, promoting flexibility."],
  "Urdhva Dhanurasana": ["Upward Bow Pose", "Backbend that opens the chest and strengthens the back, arms, and legs."],
  "Urdhva Mukha Svsnssana": ["Upward-Facing Dog Pose", "Strengthens the arms, shoulders, and back while opening the chest."],
  "Ustrasana": ["Camel Pose", "Backbend that stretches the front of the body, opening the chest and hips."],
  "Utkatasana": ["Chair Pose", "Strengthens the thighs, calves, and core muscles."],
  "Uttanasana": ["Standing Forward Bend", "Stretches the hamstrings and spine, releasing tension."],
  "Utthita Hasta Padangusthasana": ["Extended Hand-to-Big-Toe Pose", "Improves balance and flexibility, especially in the hamstrings."],
  "Utthita Parsvakonasana": ["Extended Side Angle Pose", "Strengthens the legs and opens the hips and chest."],
  "Vasisthasana": ["Side Plank Pose", "Strengthens the arms, core, and legs while improving balance."],
  "Vrksasana": ["Tree Pose", "Strengthens the legs, improves balance, and promotes focus and concentration."]
}
